; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite4 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	infrared4 - mode
	spectrograph2 - mode
	thermograph0 - mode
	spectrograph3 - mode
	infrared1 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation9 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	GroundStation5 - direction
	Star7 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared4)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument3 spectrograph3)
	(supports instrument3 infrared4)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 spectrograph3)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star7)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation9)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 infrared1)
	(supports instrument7 spectrograph2)
	(supports instrument7 infrared4)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 GroundStation6)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 spectrograph3)
	(supports instrument8 thermograph0)
	(supports instrument8 infrared4)
	(calibration_target instrument8 Star7)
	(calibration_target instrument8 GroundStation6)
	(calibration_target instrument8 GroundStation8)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star14)
	(supports instrument9 infrared1)
	(supports instrument9 infrared4)
	(calibration_target instrument9 GroundStation6)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 spectrograph2)
	(supports instrument10 spectrograph3)
	(calibration_target instrument10 GroundStation8)
	(calibration_target instrument10 GroundStation9)
	(supports instrument11 infrared4)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 GroundStation0)
	(calibration_target instrument11 GroundStation2)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon10)
	(supports instrument12 thermograph0)
	(calibration_target instrument12 GroundStation8)
	(calibration_target instrument12 GroundStation6)
	(supports instrument13 spectrograph2)
	(supports instrument13 spectrograph3)
	(calibration_target instrument13 GroundStation8)
	(calibration_target instrument13 GroundStation6)
	(calibration_target instrument13 Star4)
	(supports instrument14 infrared1)
	(supports instrument14 infrared4)
	(supports instrument14 thermograph0)
	(calibration_target instrument14 Star7)
	(calibration_target instrument14 GroundStation5)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(on_board instrument14 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite3 Phenomenon13)
	(have_image Phenomenon10 spectrograph2)
	(have_image Planet11 spectrograph2)
	(have_image Planet12 spectrograph2)
	(have_image Phenomenon13 infrared4)
	(have_image Star14 spectrograph3)
))

)

; plan
1. (turn_to satellite1 groundstation3 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 6
4. (turn_to satellite1 planet11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet11)
   goals met: 0 of 6
5. (take_image satellite1 planet11 instrument3 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 1 of 6
6. (turn_to satellite1 phenomenon13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 6
7. (take_image satellite1 phenomenon13 instrument3 infrared4)
   added: (have_image phenomenon13 infrared4)
   goals met: 2 of 6
8. (turn_to satellite1 phenomenon10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 6
9. (take_image satellite1 phenomenon10 instrument3 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 3 of 6
10. (turn_to satellite1 planet12 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet12)
   goals met: 3 of 6
11. (take_image satellite1 planet12 instrument3 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 4 of 6
12. (turn_to satellite1 star14 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star14)
   goals met: 4 of 6
13. (take_image satellite1 star14 instrument3 spectrograph3)
   added: (have_image star14 spectrograph3)
   goals met: 5 of 6
14. (turn_to satellite3 phenomenon13 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 phenomenon13)
   goals met: 6 of 6
